funnel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.05    0      -0.1)
    (0.05     0      -0.1)
    (0.05     0.1    -0.1)
	(-0.05    0.1    -0.1)
	
	(-0.05    0      0.1)
    (0.05     0      0.1)
    (0.05     0.1    0.1)
	(-0.05    0.1    0.1)
	
	(-0.05    0      1)
    (0.05     0      1)
    (0.05     0.1    1)
	(-0.05    0.1    1)
	
	(0.3      0      0.1)
	(0.3      0.1    0.1)
	(0.8      0      1)
	(0.8      0.1    1)
	
	(-0.3     0      0.1)
	(-0.3     0.1    0.1)
	(-0.8     0      1)
	(-0.8     0.1    1)
	
);

blocks
(
    hex (0 1 2 3 4 5 6 7 ) 		(10      1 		20) simpleGrading (1 1 1)
    hex (4 5 6 7 8 9 10 11) 	(10      1 		90) simpleGrading (1 1 1)
    hex (5 12 13 6 9 14 15 10) 	(30  	 1   	90) simpleGrading (1 1 1)
    hex (16 4 7 17 18 8 11 19) 	(30  	 1 		90) simpleGrading (1 1 1)
    
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (16 17 7 4)
			(16 18 19 17)
			
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (1 2 6 5)
            (5 6 13 12)
			(12 13 15 14)
			
        );
    }
    outlet
    {
        type wall;
        faces
        (
           (0 3 2 1) 
            
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (9 14 15 10)
			(8 9 10 11)
			(8 11 19 18)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
